{"id": "doc_contract_01", "title": "Contrat : formation (offre et acceptation)", "source": "POC-corpus", "text": "Un contrat se forme en principe par la rencontre d’une offre et d’une acceptation. L’offre doit être suffisamment précise et exprimer la volonté d’être lié en cas d’acceptation. L’acceptation doit correspondre à l’offre : si elle modifie des éléments essentiels, elle est souvent analysée comme une contre‑offre. Les échanges précontractuels (devis, négociations) peuvent aider à interpréter le contenu de l’accord, mais ne créent pas toujours d’obligation ferme."}
{"id": "doc_contract_02", "title": "Contrat : obligation d’information et bonne foi", "source": "POC-corpus", "text": "Dans beaucoup de systèmes juridiques, les parties doivent négocier et exécuter le contrat de bonne foi. Une obligation d’information précontractuelle peut exister lorsque l’une des parties détient une information déterminante que l’autre ignore légitimement. La mauvaise foi ou la rétention d’information peut entraîner des sanctions : dommages‑intérêts, nullité, ou adaptation du contrat selon le droit applicable."}
{"id": "doc_contract_03", "title": "Inexécution : résolution, exécution forcée, dommages-intérêts", "source": "POC-corpus", "text": "En cas d’inexécution, plusieurs remèdes existent selon le droit applicable : exécution en nature, réduction du prix, résolution/résiliation, et dommages‑intérêts. La résolution met fin au contrat ; elle peut être judiciaire ou résulter d’une clause résolutoire. Les dommages‑intérêts visent en général à réparer le préjudice prévisible et certain, en tenant compte du lien de causalité."}
{"id": "doc_corp_01", "title": "Droit des sociétés : création et gouvernance (vue générale)", "source": "POC-corpus", "text": "La création d’une société implique généralement la rédaction de statuts, la détermination du capital, et l’immatriculation. La gouvernance dépend de la forme sociale : organes de direction, pouvoirs, contrôle, et règles de décision. Les pactes d’actionnaires complètent souvent les statuts (inaliénabilité, préemption, drag/tag)."}
{"id": "doc_corp_02", "title": "Responsabilité des dirigeants : fautes de gestion (principes)", "source": "POC-corpus", "text": "Les dirigeants peuvent voir leur responsabilité engagée en cas de faute de gestion, violation de la loi ou des statuts, ou faute séparable de leurs fonctions. La responsabilité peut être civile (réparation), parfois pénale selon les infractions, et peut aussi être engagée envers la société, les associés ou des tiers."}
{"id": "doc_corp_03", "title": "M&A : due diligence (checklist synthétique)", "source": "POC-corpus", "text": "Une due diligence en M&A couvre typiquement : contrats majeurs, IP, litiges, conformité, finances, fiscal, RH, et data protection. L’objectif est d’identifier les risques, d’ajuster le prix, et de calibrer les garanties (reps & warranties) et conditions suspensives."}
{"id": "doc_ip_01", "title": "Propriété intellectuelle : droits d’auteur (bases)", "source": "POC-corpus", "text": "Le droit d’auteur protège une œuvre originale exprimée sous une forme. Il comprend des droits patrimoniaux (reproduction, représentation) et souvent des droits moraux (paternité, respect de l’œuvre) selon la juridiction. La cession ou la licence doit préciser le périmètre (territoire, durée, modes d’exploitation)."}
{"id": "doc_ip_02", "title": "Marques : distinctivité et risque de confusion", "source": "POC-corpus", "text": "Une marque doit être distinctive pour être enregistrée et protégée. Le risque de confusion s’apprécie en tenant compte de la similitude des signes et des produits/services, ainsi que du public pertinent. La surveillance et l’opposition sont des leviers de défense."}
{"id": "doc_ip_03", "title": "Brevets : nouveauté et activité inventive (principes)", "source": "POC-corpus", "text": "Un brevet vise à protéger une invention technique. Les critères usuels incluent la nouveauté, l’activité inventive, et l’application industrielle. La divulgation avant dépôt peut détruire la nouveauté, sauf exceptions limitées selon les systèmes."}
{"id": "doc_gdpr_01", "title": "RGPD : principes clés du traitement", "source": "POC-corpus", "text": "Les principes de protection des données incluent : licéité, loyauté, transparence, limitation des finalités, minimisation, exactitude, limitation de conservation, intégrité/confidentialité, et responsabilité. Ils guident la conception des traitements et la documentation (registre, DPIA si nécessaire)."}
{"id": "doc_gdpr_02", "title": "RGPD : bases légales (vue générale)", "source": "POC-corpus", "text": "Un traitement doit reposer sur une base légale adaptée : consentement, exécution d’un contrat, obligation légale, sauvegarde d’intérêts vitaux, mission d’intérêt public, ou intérêts légitimes. Le choix dépend du contexte ; le consentement doit être libre, spécifique, éclairé et univoque."}
{"id": "doc_gdpr_03", "title": "RGPD : droits des personnes", "source": "POC-corpus", "text": "Les personnes disposent de droits : information, accès, rectification, effacement, limitation, opposition, portabilité, et (dans certains cas) droit de ne pas faire l’objet d’une décision automatisée. Les procédures internes doivent permettre de répondre dans les délais applicables."}
{"id": "doc_crim_01", "title": "Procédure pénale : garde à vue (notions générales)", "source": "POC-corpus", "text": "La garde à vue est une mesure de contrainte permettant le maintien d’une personne soupçonnée pour les besoins d’une enquête, sous conditions et contrôle. Des droits sont généralement garantis : assistance d’un avocat, information, examen médical, notification à un proche selon la loi applicable."}
{"id": "doc_crim_02", "title": "Infractions : élément matériel, moral et légal", "source": "POC-corpus", "text": "Une infraction suppose typiquement un élément légal (texte), un élément matériel (acte ou omission), et un élément moral (intention ou négligence selon l’infraction). La qualification pénale dépend de la réunion de ces éléments et des circonstances."}
{"id": "doc_lit_01", "title": "Contentieux civil : charge de la preuve (vue générale)", "source": "POC-corpus", "text": "En contentieux civil, la charge de la preuve pèse en principe sur celui qui allègue un fait. Les modes de preuve varient : écrit, témoignage, expertise, présomptions. Certaines règles imposent un écrit au‑delà de seuils ou pour des actes spécifiques."}
{"id": "doc_ethics_01", "title": "Cabinet d’avocats : confidentialité et secret professionnel", "source": "POC-corpus", "text": "Le secret professionnel protège les échanges avocat‑client et certaines informations obtenues dans l’exercice de la défense et du conseil. Dans un chatbot interne, il faut cloisonner l’accès, tracer les consultations, minimiser les données sensibles, et éviter l’envoi de contenus confidentiels à des services externes sans garanties."}
{"id": "doc_risk_01", "title": "Risque RAG : hallucination et atténuation", "source": "POC-corpus", "text": "Un système RAG réduit les hallucinations en ancrant la réponse dans des sources retrouvées, mais le risque reste. Atténuations : consignes strictes 'répondre uniquement avec le contexte', citations obligatoires, seuil de similarité, refus contrôlé, et évaluation régulière."}
{"id": "doc_drafting_01", "title": "Rédaction : clause de limitation de responsabilité (points d’attention)", "source": "POC-corpus", "text": "Une clause de limitation de responsabilité précise les plafonds, exclusions, et catégories de dommages (indirects, perte de profit...). Elle doit être cohérente avec le régime légal impératif et les obligations essentielles. Les clauses de pénalité, garanties, et assurances interagissent avec ce type de clause."}
